samples/weather-service/prague-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-CALL>
    <SOAP-FIELDS>
        <service xml:space="preserve">weather-service</service>
        <port xml:space="preserve">weather-soap</port>
        <operation xml:space="preserve">weather-by-city</operation>
        <URL xml:space="preserve">http://localhost:8080/ws-xslt/srv/weather</URL>
        <action xml:space="preserve">http://www.fgeorges.org/ws/test/weather/weather-by-city</action>
        <soapVersion xml:space="preserve">1.1</soapVersion>
    </SOAP-FIELDS>
    <REQUEST><![CDATA[&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;SOAP-ENV:Header/&gt;
   &lt;SOAP-ENV:Body&gt;
      &lt;weather-by-city-request xmlns=&quot;http://www.fgeorges.org/ws/test/weather&quot;&gt;
         &lt;city&gt;Prague&lt;/city&gt;
         &lt;country&gt;CZ&lt;/country&gt;
      &lt;/weather-by-city-request&gt;
   &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
]]></REQUEST>
</SOAP-CALL>
